Autodesk.Revit.DB.FilterDoubleRule.#ctor(Autodesk.Revit.DB.FilterableValueProvider,Autodesk.Revit.DB.FilterNumericRuleEvaluator,System.Double,System.Double)
Constructs an instance of FilterDoubleRule.
valueProvider:
A pointer to a "value provider" object that will extract values from a Revit document.
evaluator:
A pointer to the filter rule evaluator object that implements the desired test.
The built-in evaluators implement commonly used tests such as less-than, greater-than
less-than-or-equal-to, equal, etc.
ruleValue:
The user-supplied value against which values from a Revit document will be tested.
epsilon:
The tolerance within which two floating-point values may be considered equal.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for ruleValue is not finite
-or-
The given value for ruleValue is not a number
-or-
The given value for epsilon is not finite
-or-
The given value for epsilon is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011